#include<iostream>
#include<vector>
using namespace std;

void main() {

	/*—оздать вектор из 10 элементов и заполнить его случайными числами в диапазоне от - 50 до 50.
		1.	ѕрибавить к каждому числу корень квадратный из произведени€ первого и последнего числа, хран€щегос€ в векторе.
		2.	–азделить каждое число на сумму 1 - ого отрицательного числа и 5 - ого(по пор€дку) числа.
		3.	–азделить все нечетные числа на среднее арифметическое
		4.	¬ычесть из каждого числа сумму всех чисел
		5.	”множить каждое 3 - ее число на сумму 2 - х предыдущих чисел


		—оздать список из 10 элементов и заполнить его случайными числами в диапазоне от - 50 до 50.
		1.	«аменить все нули средним арифметическим
		2.	—ложить каждое число с последним отрицательным числом
		3.	«аменить все положительные числа максимальным числом
		4.	«аменить каждое второе отрицательное число половиной минимума
		5.	«аменить каждое четное число разностью максимума и минимума*/





	system("pause");
}